{
  "ir_version": "1.0",
  "compiled_at": "1970-01-01T00:00:00Z",
  "source_file": "tests/corpus/moderation_triage.flow",
  "types": [
    {
      "name": "ModerationRequest",
      "kind": "record",
      "fields": [
        {"name": "content_id", "type": "string"},
        {"name": "text", "type": "string"},
        {"name": "image_url", "type": "string"},
        {"name": "author_id", "type": "string"}
      ]
    },
    {
      "name": "AccountContext",
      "kind": "record",
      "fields": [
        {"name": "user_id", "type": "string"},
        {"name": "prior_violations", "type": "int"},
        {"name": "age_days", "type": "int"}
      ]
    },
    {
      "name": "ClassifierScores",
      "kind": "record",
      "fields": [
        {"name": "hate", "type": "float"},
        {"name": "harassment", "type": "float"},
        {"name": "sexual", "type": "float"},
        {"name": "violence", "type": "float"},
        {"name": "self_harm", "type": "float"},
        {"name": "spam", "type": "float"}
      ]
    },
    {
      "name": "ModerationDecision",
      "kind": "record",
      "fields": [
        {"name": "action", "type": "string"},
        {"name": "severity", "type": "float"},
        {"name": "requires_human_review", "type": "bool"}
      ]
    }
  ],
  "tools": [
    {
      "name": "blocklist_check",
      "input": [
        {"name": "text", "type": "string"}
      ],
      "output": "bool",
      "effect": {
        "level": "deterministic"
      }
    },
    {
      "name": "run_text_classifier",
      "input": [
        {"name": "text", "type": "string"}
      ],
      "output": "ClassifierScores",
      "effect": {
        "level": "model",
        "model": "text-classify-v1"
      }
    },
    {
      "name": "run_image_classifier",
      "input": [
        {"name": "url", "type": "string"}
      ],
      "output": "ClassifierScores",
      "effect": {
        "level": "model",
        "model": "image-classify-v1"
      }
    },
    {
      "name": "get_account_context",
      "input": [
        {"name": "user_id", "type": "string"}
      ],
      "output": "AccountContext",
      "effect": {
        "level": "deterministic"
      }
    },
    {
      "name": "decide_action",
      "input": [
        {"name": "req", "type": "ModerationRequest"},
        {"name": "text_scores", "type": "ClassifierScores"},
        {"name": "image_scores", "type": "ClassifierScores"},
        {"name": "account", "type": "AccountContext"}
      ],
      "output": "ModerationDecision",
      "effect": {
        "level": "model",
        "model": "moderate-decide-v1"
      }
    },
    {
      "name": "apply_action",
      "input": [
        {"name": "content_id", "type": "string"},
        {"name": "action", "type": "string"}
      ],
      "output": "bool",
      "effect": {
        "level": "mutation"
      }
    }
  ],
  "flows": [
    {
      "name": "moderate",
      "params": [
        {"name": "it", "type": "ModerationRequest", "implicit": true}
      ],
      "output": "ModerationDecision",
      "bindings": [
        {
          "name": "blocked_by_list",
          "expr": {
            "kind": "call",
            "tool": "blocklist_check",
            "args": [
              {
                "field": "text",
                "value": {
                  "kind": "path",
                  "segments": ["it", "text"]
                }
              }
            ]
          }
        },
        {
          "name": "text_scores",
          "expr": {
            "kind": "call",
            "tool": "run_text_classifier",
            "args": [
              {
                "field": "text",
                "value": {
                  "kind": "path",
                  "segments": ["it", "text"]
                }
              }
            ]
          }
        },
        {
          "name": "image_scores",
          "expr": {
            "kind": "call",
            "tool": "run_image_classifier",
            "args": [
              {
                "field": "url",
                "value": {
                  "kind": "path",
                  "segments": ["it", "image_url"]
                }
              }
            ]
          }
        },
        {
          "name": "account",
          "expr": {
            "kind": "call",
            "tool": "get_account_context",
            "args": [
              {
                "field": "user_id",
                "value": {
                  "kind": "path",
                  "segments": ["it", "author_id"]
                }
              }
            ]
          }
        },
        {
          "name": "decision",
          "expr": {
            "kind": "call",
            "tool": "decide_action",
            "args": [
              {
                "field": "req",
                "value": {
                  "kind": "path",
                  "segments": ["it"]
                }
              },
              {
                "field": "text_scores",
                "value": {
                  "kind": "path",
                  "segments": ["text_scores"]
                }
              },
              {
                "field": "image_scores",
                "value": {
                  "kind": "path",
                  "segments": ["image_scores"]
                }
              },
              {
                "field": "account",
                "value": {
                  "kind": "path",
                  "segments": ["account"]
                }
              }
            ]
          }
        },
        {
          "name": "applied",
          "expr": {
            "kind": "call",
            "tool": "apply_action",
            "args": [
              {
                "field": "content_id",
                "value": {
                  "kind": "path",
                  "segments": ["it", "content_id"]
                }
              },
              {
                "field": "action",
                "value": {
                  "kind": "path",
                  "segments": ["decision", "action"]
                }
              }
            ]
          }
        }
      ],
      "return": {
        "kind": "path",
        "segments": ["decision"]
      }
    }
  ]
}
