{
  "ir_version": "1.0",
  "compiled_at": "2026-06-15T23:59:56Z",
  "source_file": "bindings/python/tests/fixtures/score.flow",
  "types": [
    {
      "name": "RiskReport",
      "kind": "record",
      "fields": [
        {"name": "score", "type": "int"},
        {"name": "flagged", "type": "bool"}
      ]
    }
  ],
  "tools": [
    {
      "name": "risk_check",
      "input": [
        {"name": "amount", "type": "int"}
      ],
      "output": "RiskReport",
      "effect": {
        "level": "model",
        "model": "risk-v1"
      }
    }
  ],
  "flows": [
    {
      "name": "score",
      "params": [
        {"name": "it", "type": "int", "implicit": true}
      ],
      "output": "int",
      "bindings": [
        {
          "name": "report",
          "expr": {
            "kind": "call",
            "tool": "risk_check",
            "args": [
              {
                "field": "amount",
                "value": {
                  "kind": "path",
                  "segments": ["it"]
                }
              }
            ]
          }
        }
      ],
      "return": {
        "kind": "path",
        "segments": ["report", "score"]
      }
    }
  ]
}
