{
  "ir_version": "1.0",
  "compiled_at": "1970-01-01T00:00:00Z",
  "source_file": "tests/fixtures/empty_list_context.flow",
  "types": [
    {
      "name": "Bucket",
      "kind": "record",
      "fields": [
        {"name": "items", "type": "[int]"},
        {"name": "tags", "type": "[string]"}
      ]
    }
  ],
  "tools": [],
  "flows": [
    {
      "name": "empty_bucket",
      "params": [
        {"name": "unused", "type": "int", "implicit": false}
      ],
      "output": "Bucket",
      "bindings": [],
      "return": {
        "kind": "construct",
        "type": "Bucket",
        "fields": [
          {
            "name": "items",
            "value": {
              "kind": "list_literal",
              "element_type": "int",
              "elements": []
            }
          },
          {
            "name": "tags",
            "value": {
              "kind": "list_literal",
              "element_type": "string",
              "elements": []
            }
          }
        ]
      }
    }
  ]
}
