{
  "ir_version": "1.0",
  "compiled_at": "1970-01-01T00:00:00Z",
  "source_file": "tests/fixtures/list_lit_smoke.flow",
  "types": [],
  "tools": [],
  "flows": [
    {
      "name": "constants",
      "params": [
        {"name": "unused", "type": "int", "implicit": false}
      ],
      "output": "[int]",
      "bindings": [],
      "return": {
        "kind": "list_literal",
        "element_type": "int",
        "elements": [
          {
            "kind": "literal",
            "value": 10,
            "type": "int"
          },
          {
            "kind": "literal",
            "value": 20,
            "type": "int"
          },
          {
            "kind": "literal",
            "value": 30,
            "type": "int"
          }
        ]
      }
    }
  ]
}
