{
  "ir_version": "1.0",
  "compiled_at": "1970-01-01T00:00:00Z",
  "source_file": "tests/fixtures/sum_smoke.flow",
  "types": [
    {
      "name": "Hypothesis",
      "kind": "sum",
      "variants": [
        {
          "name": "DeployCaused",
          "fields": [
            {"name": "suspect_deploy_id", "type": "string"}
          ]
        },
        {
          "name": "CapacityIssue",
          "fields": [
            {"name": "resource", "type": "string"}
          ]
        }
      ]
    }
  ],
  "tools": [],
  "flows": [
    {
      "name": "propose",
      "params": [
        {"name": "it", "type": "string", "implicit": true}
      ],
      "output": "Hypothesis",
      "bindings": [],
      "return": {
        "kind": "construct_variant",
        "type": "Hypothesis",
        "variant": "DeployCaused",
        "fields": [
          {
            "name": "suspect_deploy_id",
            "value": {
              "kind": "path",
              "segments": ["it"]
            }
          }
        ]
      }
    }
  ]
}
